02 ADDRESSE. 
       03 VEJNAVN       PIC X(30). 
       03 HUSNR         PIC X(5). 
       03 ETAGE         PIC X(5). 
       03 SIDE          PIC X(5). 
       03 CITY            PIC X(20). 
       03 POSTNR        PIC X(4). 
       03 LANDE-KODE    PIC X(2). 
02  KONTAKT.
       03 TELEFON       PIC X(8). 
       03 EMAIL         PIC X(50).
